{
    "pageTextData": [
      {
        "title": "Welcome to the <b>Virtual Museum of Firearms</b>.",
        "description": "This is an unofficial collection of 3D models and renders of historical firearms inspired to the original collection at the <a href=\"https://royalarmouries.org/\"><b>Royal Armouries Museum</b></a>, in Leeds, UK."
      },
      {
        "title": "Explore a historical collection.",
        "description": "Navigate to the <a href=\"#\">Models</a> section to access a 3D visualisation of the geometry of the 4 firearms included in this collection, or explore the <a href=\"#\">Gallery</a> for a range of images rendered with optimal lighting and viewpoints."
      },
      {
        "title": "About",
        "description": "This website was created using <b>HTML5</b>, <b>CSS3</b>, <b>Javascript</b> (with JQuery), <b>AJAX</b>, <b>PHP7</b> and <b>SQLite</b> with an <b>MVC</b> design pattern. The framework used is <b>Bootstrap 4</b>. The IDE used were JetBrains' <b>PhpStorm 2019</b>, <b>Sublime Text 3</b> and <b>Visual Studio Code</b>. The 3D objects are modelled using Autodesk's <b>3D Studio Max 2017</b> and rendered using NVidia <b>Mental Ray</b>. The textures were edited using Adobe <b>Photoshop</b>. The 3D models include <b>VRML97</b> Helpers, are tested on instantreality and embedded using the XML-based technology <b>X3DOM</b>."
      },
      {
        "title": "3D Models",
        "description": "The 3D models displayed below are built in 3D Studio Max and use VRML97 Helpers for web interaction. They are embedded with the XML-based technology X3DOM.<br>Click and drag to inspect the model. Click on the model for redirection to its Royal Armouries web page. Press R to reset the viewpoint. Use the buttons and sliders below to change camera view, toggle lights, animation and wireframe mode, or to apply a layer of fog on the model."
      },
      {
        "title": "Gallery",
        "description": "The 3D images displayed below are rendered with NVidia Mental Ray. Switch between Slideshow and Cards mode using the apposite buttons. When in Slideshow mode, you can navigate the images using the Prev and Next buttons below. When in Cards mode, you can click on each card to open a lightbox and see the image in full resolution (1920 x 1080)."
      },
      {
        "title": "Extras",
        "description": "In working on this website, all measures were taken to ensure a high quality of navigation, usability and user experience. In particular,<br><ul><li><b>3D Geometry</b>:<br>The objects selected for modelling presented a high degree of complexity, and were built with performance in mind. In this, each model contains the lowest amount of polys to maintain the realistic look that characterises this Web 3D experience.</li><li><b>Photorealistic texturing & rendering</b>:<br>The rendering takes advantage of photorealistic textures, edited using Photoshop for brightness, contrast, curves, colour correction and background, to provide an immersive experience. Additionally, a cloth simulation was made using physics and Cloth modifiers to create beautiful and realistic renders for each model.</li><li><b>CSS Styling</b>:<br>The 3D App was designed with usability and user experience in mind. Fluid grid layouts were used where appropriate, and input features were redesigned to override the default Bootstrap 4 ones (i.e. by recreating a style and colour theme and respecting it throughout the app) to create a unique experience.<ul><li><b>Lightboxes</b> were used to improve the gallery navigation experience;</li><li><b>Text and Image Keyframe-Based Animations</b> were implemented to improve the aesthetic of the home page;</li><li>A <b>Sidebar</b> was implemented because considered a better, more user-friendly way of navigating when designing the 3D App to be Mobile-First;</li><li><b>Smooth Transitions Between Content</b> were achieved using the fadeIn() JQuery function when fetching and swapping divs within the 3D App;</li><li>Both <b>Slideshow & Cards Gallery Navigation Modes</b> were provided to tailor the experience to all kind of users;</li><li><b>Full Responsiveness</b> allows the 3D App to be experienced optimally cross-platform, on all devices and screen sizes.</li></ul></li><li><b>Javascript/JQuery Interactivity & Relation to MVC Design Pattern</b>: Data included in the 3D App is read from a JSON file, stored in a SQLite database and fetched to the front-end using JQuery. This ensures a smooth content-insertion workflow, which takes advantage of an extended MVC design pattern and of an easy to manage database that includes all CRUD functions needed for the implementation. Content in the SPA is swapped using JQuery effects to improve the user experience.</li><li><b>3D Interactivity</b>: Animations are designed to be on theme with the object. Different camera views and lights are provided for user interaction, together with extra interactions such as a fog modifier. AnchorPoints were used to allow the user to click on the model to navigate to the webpage of the Royal Armouries Museum. Maximum care was taken with customised pivot points (for geometry, animation and with the VRML97 Helpers) to allow for optimal exporting and web interaction experience.</li></ul>"
      },
      {
        "title": "Statement of Originality",
        "description": "This assignment is submitted as part requirement for the degree of Computer Science and Artificial Intelligence at the University of Sussex. It is the product of my own labour except where indicated. The assignment may be freely copied and distributed provided the source is acknowledged."
      },
      {
        "title": "References",
        "description": "<a href=\"https://www.pinterest.com.mx/pin/446700856785471742/?lp=true\">Main image</a><br><a href=\"https://www.onlinewebfonts.com/icon/562022\">Lightboxes</a><br><a href=\"http://aidigit.com/Buenosaires/Imagenes/Interior/modelos/Materials/\">Cloth Texture</a><br><a href=\"https://royalarmouries.org/\">Weapons Textures (Original)</a> (edited versions are available at 3dapp/assignment/assets/images/sceneassets)<br><a href=\"http://animista.net/\">Keyframe-based CSS animations</a><br><a href=\"https://www.w3schools.com/\">W3School Various CSS and HTML resources</a>"
      },
      {
        "title": "Download",
        "description": "Download description"
      },
      {
        "title": "Site Map",
        "description": "<ul><li>Home<li>About</li><li>Models<li>Revolver</li><li>Pistol</li><li>Rifle</li><li>Sniper</li></li><li>Gallery<li>Slideshow</li><li>Cards</li></li><li>Extras</li><li>Originality</li><li>Downloads</li><li>References</li><li>Site Map</li><li>GitHub</li></li></ul>"
      },
      {
        "x3dModelTitle": "2017_revolver.x3d",
        "x3dCreationMethod": "This X3D model has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
        "title": "Centrefire six-shot revolver - Smith & Wesson New Model No.3 Target",
        "date": "about 1889",
        "number": "XII.11101",
        "provenance": "Manufactured by S&W in 1888 or 1889 Supplied to Winans Jan 5 1893 Acquired by Flinders Petrie date unknown Gifted to Carl Pape date unknown Retained by his family Acquired by Royal Armouries under deposit number A0290",
        "description": "A cased example of a Target model wth 6.5 barrel and barleycorn style front sight. High quality blue finish and with colour case-hardened hammer. It is engraved with the owners initials and competition details.",
        "link": "https://collections.royalarmouries.org/object/rac-object-48648.html",
        "image": ["revolver", "revolver_cam1", "revolver_cam2", "revolver_cam3"]
      },
      {
        "x3dModelTitle": "2017_pistol.x3d",
        "x3dCreationMethod": "This X3D model has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
        "title": "Centrefire self-loading pistol - Makarov PM Darra copy",
        "date": "about 2011",
        "number": "XII.11886",
        "provenance": "Gifted by the Ministry of Defence, February 2016",
        "description": "This Pakistani or Afghani copy or refurbished Makarov PM is a medium-size pistol with a straight blowback action and is of all steel construction with a frame-fixed barrel. In a blowback designs such as this, the only force holding the slide closed is that of the recoil spring wrapped around the barrel; as a consequence upon firing the barrel and slide do not have to unlock. Blowback designs are simple and more accurate than designs using a recoiling, tilting, or articulated barrel, but they are limited practically by the need to have weight in the slide. The 9×18mm cartridge (Russian designation: 57-N-181S) around which this pistol was designed provides enough energy to action the blowback design. The PM is heavy for its size, largely because of the heavy slide which is needed to provide greater inertia to delay the opening of the breech until internal pressures have fallen to a safe level. The Makarov design is widely regarded as particularly well balanced. The slide also has a full- length textured anti-glare strip on the top In concept the Makarov PM is a very simple pistol, the designer Makarov and his team, during development, drastically simplified the construction of the pistol, improving its reliability and reducing the number of parts to an astonishing 27, not including the magazine. The non-chrome-lined, 4-groove, right hand twist, 9.27mm (true calibre) barrel is pressed and pinned to the frame through a precision-machined ring. There should a 7kg rated recoil spring that wraps around the barrel which also acts as the spring guide. The front sight is integrally machined into the slide. The fixed rear sight is dovetailed into the slide. The extractor is of an external spring-loaded type. The breech face is deeply recessed in order to improve extraction and ejection reliability. The stamped sheet steel slide-lock lever has an internal tail serving the additional purpose of an ejector. The one-piece, wraparound bakelite or later plastic grip is reinforced with steel inserts and has a detent inside the screw bushing preventing unscrewing during firing. There is an impressed 5 pointed star within a circle on each side of the grip. A lanyard ring is affixed on the left side of the grip. The sheet-metal mainspring housed inside the grip operates the hammer, the trigger and the disconnector, and its lower end is the heel and spring of the magazine catch. The sear spring also serves a dual purpose by operating the slide-lock lever. The Model PM has a free-floating triangular shaped firing pin, with no firing pin spring or firing pin block. This example has engraved serial numbers which are 3mm in size instead of 4mm, the quality of the engraving is also suspect. There is also no evidence of inspection stamps. All of the Pakistani or Afghani copy or refurbished Makarov PMs seem to be dated 1991, clearly a spurious date.",
        "link": "https://collections.royalarmouries.org/object/rac-object-83296.html",
        "image": ["pistol", "pistol_cam1", "pistol_cam2", "pistol_cam3"]
      },
      {
        "x3dModelTitle": "2017_rifle.x3d",
        "x3dCreationMethod": "This X3D model has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
        "title": "Centrefire automatic rifle - SCAR-H",
        "date": "2012",
        "number": "XXX.287",
        "provenance": "New manufacture by Herstal, Belgium, purchased via their UK agent Law Enforcement International Ltd, 3rd October 2011",
        "description": "Composite plastics and carbon steel",
        "link": "https://collections.royalarmouries.org/object/rac-object-55735.html",
        "image": ["rifle", "rifle_cam1", "rifle_cam2", "rifle_cam3"]
      },
      {
        "x3dModelTitle": "2017_sniper.x3d",
        "x3dCreationMethod": "This X3D model has been created in 3ds Max, exported to VRML97 and converted, using the instantreality transcoders, to X3D for display online.",
        "title": "Centrefire self-loading sniper rifle - SVD Dragunov",
        "date": "1986",
        "number": "XXIV.8853",
        "provenance": "Transferred from M.87",
        "description": "Fitted with scope",
        "link": "https://collections.royalarmouries.org/object/rac-object-45755.html",
        "image": ["sniper", "sniper_cam1", "sniper_cam2", "sniper_cam3"]
      }
    ]
  }